tutorials/heatTransfer/buoyantSimpleRadiationFoam/hotRadiationRoom/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p PCG
    {
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0.01;
    };
    U BiCGStab
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0.1;
    };
    h BiCGStab
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0.1;
    };
    k BiCGStab
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0.1;
    };
    epsilon BiCGStab
    {
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0.1;
    };
    G PCG
    {
        preconditioner   DIC;
        tolerance        1e-05;
        relTol           0.1;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell         0;
    pRefValue        0;
}

relaxationFactors
{
    rho             1.0;
    p               0.3;
    U               0.7;
    h               0.7;
    k               0.7;
    epsilon         0.7;
    G               0.7;
}


// ************************************************************************* //
